"""


Тестирование класса Вектор
==========================


Служебное строковое представление Вектора:
    >>> Vector(3, 4)
    Vector(3, 4)


Доступ к полям вектора осуществляется через свойства:
    >>> vector = Vector(3, 4)
    >>> vector.x
    3
    >>> vector.y
    4

    
Модуль Вектора вычисляется с помошью стандартной функции abs:
    >>> vector = Vector(3, 4)
    >>> abs(vector)
    5.0


Умножение вектора на число:
    >>> vector = Vector(3, 4)
    

"""

from kode.source.test_vector.vector import Vector
